2024/rapport-2024-07-26.org
#+title: Rapport hebdomadaire
#+subtitle: Contrat Été 2024
#+author: Charles-Édouard Lizotte
#+date:26/07/2024
#+LANGUAGE: fr
#+BIBLIOGRAPHY: master-bibliography.bib
#+OPTIONS: toc:nil title:nil 
#+LaTeX_class: org-report

\mytitlepage
\tableofcontents\newpage

* Maîtrise de Eliot Bismuth

** Équations en jeu
Rapidement, les équations d'évolution de l'énergie associée à chaque fréquences est donnée par
#+name:eq:energy
\begin{equation}
   \frac{1}{c_g}\dv{E}{t} = (1-f_i)\qty(S_{in} + S_{wc}) + f_i S_{ice}.
\end{equation}

S'il fallait isoler l'advection dans l'équation [[eq:energy]], nous aurions
#+name:eq:bismuth:advection
\begin{equation}
   \pdv{E(\omega,x,t)}{t} + \dot{x}\pdv{E}{x} + \dot{\omega} \pdv{E}{\omega} = 0
\end{equation}
Mais nous n'avons pas vraiment accès à toutes ces quantités.
Il faudra trouver un moyen d'observer le /spreading/ temporel des fréquences.\bigskip

\nb On va résoudre cette question dans les sections suivantes.

** Rappel rapide et conceptuelle d'une onde dans le contexte des vagues
La solution à l'équation d'onde est illustrée par une somme des solutions qui satisfont aussi la même équation (combination linéaire de solutions).
D'où la possibilité de représenter la vraie solution par une somme de Fourier.
La hauteur de la surface est ainsi illustrée par
#+name:eq:onde:basique
\begin{equation}
   h(\vb{x},t) = \sum_{i,j,k} A_{i,j,k}\cdot\sin(k_{x,i} \cdot x + k_{y,i}\cdot y - \omega_j t + \phi_k)\quad
    \text{où}\quad\left\lbrace\begin{matrix}
      k_{x,i} = k\cos(\theta_{i}), \\
      k_{y,i} = k\sin(\theta_{i}). \\
    \end{matrix}\right.
\end{equation}
Par contre, il existe une relation de dispersion (voir [[eq:relation:dispersion]] à la sous-section suivante), de sorte que [[eq:onde:basique]] devienne
\begin{equation}
   h(\vb{x},t) = \sum_{i,j} A_{i,j}\cdot\sin(\vb{k}(\theta_i)\cdot \vb{x} - \omega(\theta_i)\cdot t + \phi_j)
\end{equation}
On sait aussi qu'en moyenne, la phase est nulle, de sorte que $\expval{\phi_j} = 0$, donc on peut de nouveau se débarrasser d'un indice $j$.
Mentionnons aussi que la constante de phase n'est vraiment pas une quantitée importante dans la représentation mathématique de nos vagues, car les vagues se propagente et on s'intéresse plutôt au spectre, donc
\begin{equation}
   h(\vb{x},t) = \sum_{i} A_{i} \cdot\sin(\vb{k}_i \cdot \vb{x} - \omega_i \cdot t)
\end{equation}
Conceptuellement, dans une modèle à différences finies, la fréquence $\omega$ n'est qu'une variable comme une autre, de sorte que la hauteur de la surface pourrait aussi être illustrée par
#+name:eq:solution:vague
\begin{equation}
   \boxed{\quad h(\vb{x},t,k) = A(k) \cdot\sin(\vb{k} \cdot \vb{x} - \sqrt{gk}\cdot t).\quad}
\end{equation}
Ainsi, toutes les vagues se propageant à la surface de l'océan devraient avoir la composante [[eq:solution:vague]] précédente.
Pour obtenir les coefficients de notre transformée de Fourier spatiale, on intégrerait justement par rapport aux /vagues possibles mathématiquement/ (la forme qu'on a trouvé précédemment), soit
\begin{equation}
   A(k,t) = \iint_0^{x_{max}} \tilde{h}(\vb{x},t,k) \cdot \sin(\vb{k} \cdot \vb{x} - \sqrt{gk}\cdot t) \dd x\dd y.
\end{equation}
où $\tilde{h}$ fait justement référence au champ de vagues réel. 
Heureusement, grace au théorême de Parseval, on sait qu'il existe une invariant qui nous permet de dire
\begin{equation}
   E(t) \propto \sum_i \qty[A(k_i,t)]^2 = \sum_i \qty[h(\vb{x}_i,t)]^2
\end{equation}
d'oû la possibilité d'évaluer l'énergie pour chaque nombre d'onde $k_i$ et fréquences $\omega_i$.

