2024/Fichiers_tex/rapport-2024-07-26.tex
% Created 2024-08-20 Tue 16:12
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
% =================================BASE====================================%
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc
\usepackage{csquotes} % Recommandé par PDFLatex lors de la compilation. 

% Calligraphie
%\usepackage{pxfonts} % Met le texte ET les maths en Palatino + donne accès à des symboles math
%\usepackage{palatino} % Cette commande met seulement le texte en police palatino
\usepackage{lmodern} % Pour les maths? Lmodern pour les maths
\usepackage{cfr-lm}
% Use lmodern for sans-serif
\usepackage{mathrsfs} % Permet la command \mathscr (Lettres attachées genre) \mathscr(B)

% Bibliographie
\usepackage[backend=bibtex,style=apa,sorting=ynt]{biblatex}
%\usepackage[backend=biber,sorting=ynt,style=authoryear-comp]{biblatex} % N'est pas utilisé par le compilateur org-mode, mais NÉCESSAIRE. Voir le fichier init.el pour changer le style. 
\addbibresource{master-bibliography.bib}


\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.
\usepackage{mathtools,cancel,xfrac} % Utilisation de boîtes \boxed{} + \cancelto{}{}, xfrac
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage{colortbl} % Color tables
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.

% Physique
\usepackage{physics} % Meilleur package pour physicien. 

% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usetikzlibrary{arrows.meta,bending} % Arrow heads 
\usepackage{empheq} % Boite autour de MULTIPLE équations
\usepackage{bbding}

% Français
\usepackage[french]{babel} % Environnements en Français.

\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% ==============================BASE-(END)=================================%





% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
% \rowcolors{3}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}

% Retirer l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}

% Change bullet style
\usepackage{pifont}
\usepackage{enumitem}
%\setlist[itemize,1]{label=\ding{224}}
\setlist[itemize,1]{label=\ding{239}}
\renewcommand{\boxtimes}{\blacksquare}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%
% CQFD symbol
\renewcommand{\qedsymbol}{$\hfill\blacksquare$}

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\evf}{\vb{\hat{e}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}
\newcommand{\uu}{\vb{u}}
\newcommand{\vv}{\vb{v}}
\newcommand{\ust}{\vb{u}_{\ast}}

% Physics empty spaces 
\newcommand{\short}{\vphantom{pA}}
\newcommand{\tall}{\vphantom{pA^{x^x}_p}}
\newcommand{\grande}{\vphantom{\frac{1}{xx}}}
\newcommand{\venti}{\vphantom{\sum_x^x}}
\newcommand{\pt}{\hspace{1pt}} % One horizontal pt space

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}
\newcommand{\zmean}[1]{\overline{#1}^z}
\newcommand{\xymean}[1]{\overline{#1}^{xy}}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
\newcommand{\tphi}{\tilde{\phi}}

% Nota Bene env : (\ding{89})
%\newcommand{\nb}{$\boxed{\text{\footnotesize\EightStarConvex}\pt \mathfrak{N. B.}}$\hspace{4pt}}
\newcommand{\nb}{\underline{{\footnotesize\EightStarConvex}\pt $\mathfrak{N.B.}$\vphantom{p}}\hspace{3pt}}

\newcommand{\exemple}{
\parbox[center]{2.2cm}{\begin{tcolorbox}[sharp corners, rounded corners=northeast, rounded corners=southeast,
colback=Violet!2, colframe=black,
size=small, width=2cm, left=-0.25pt, bottom=-0.5pt,
arc is angular, arc=2.5mm, boxrule=0.35pt, leftrule=4pt, %bottomrule=1pt,
after={\enskip}] Exemple \end{tcolorbox}}}

\newcommand{\rad}{\text{Rad}}


\newcommand{\cqfd}{\hfill$\blacktriangleleft$}

% Define the nota bene environment
\usepackage{tcolorbox}
\newtcolorbox{notabene}{
     colback=blue!5,
     colframe=black,
     boxrule=0.5pt,
     arc=2pt,
     left=5pt,
     right=5pt,
     top=5pt,
     bottom=5pt,
}


\newcommand{\cmark}{\ding{52}}
\newcommand{\xmark}{\ding{55}}
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Huge \thesubtitle \par}
\vspace{2cm}
{\Huge \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Huge ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR\\
Police d'écriture : \textbf{CMU Serif Roman}
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{0.025pt} % Ligne horizontale en haut

\fancyhead[R]{\textit{\thetitle}}
\fancyhead[L]{\ \thepage}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{26/07/2024}
\title{Rapport hebdomadaire}
\newcommand{\thesubtitle}{Contrat Été 2024}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Rapport hebdomadaire},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.8)}, 
 pdflang={French}}
\begin{document}

\mytitlepage
\tableofcontents\newpage
\section{Maîtrise de Eliot Bismuth}
\label{sec:orgbd387cd}

\subsection{Équations en jeu}
\label{sec:org89b4ec7}
Rapidement, les équations d'évolution de l'énergie associée à chaque fréquences est donnée par
\begin{equation}
\label{eq:org6ce8bb6}
   \frac{1}{c_g}\dv{E}{t} = (1-f_i)\qty(S_{in} + S_{wc}) + f_i S_{ice}.
\end{equation}

S'il fallait isoler l'advection dans l'équation \ref{eq:org6ce8bb6}, nous aurions
\begin{equation}
\label{eq:orgea0c11e}
   \pdv{E(\omega,x,t)}{t} + \dot{x}\pdv{E}{x} + \dot{\omega} \pdv{E}{\omega} = 0
\end{equation}
Mais nous n'avons pas vraiment accès à toutes ces quantités.
Il faudra trouver un moyen d'observer le \emph{spreading} temporel des fréquences.\bigskip

\nb On va résoudre cette question dans les sections suivantes.
\subsection{Rappel rapide et conceptuelle d'une onde dans le contexte des vagues}
\label{sec:orgbf6c09c}
La solution à l'équation d'onde est illustrée par une somme des solutions qui satisfont aussi la même équation (combination linéaire de solutions).
D'où la possibilité de représenter la vraie solution par une somme de Fourier.
La hauteur de la surface est ainsi illustrée par
\begin{equation}
\label{eq:orga4ed0fb}
   h(\vb{x},t) = \sum_{i,j,k} A_{i,j,k}\cdot\sin(k_{x,i} \cdot x + k_{y,i}\cdot y - \omega_j t + \phi_k)\quad
    \mathrm{où}\quad\left\lbrace\begin{matrix}
      k_{x,i} = k\cos(\theta_{i}), \\
      k_{y,i} = k\sin(\theta_{i}).
    \end{matrix}\right.
\end{equation}
Par contre, il existe une relation de dispersion (voir \ref{eq:org282f871} à la sous-section suivante), de sorte que \ref{eq:orga4ed0fb} devienne
\begin{equation}
   h(\vb{x},t) = \sum_{i,j} A_{i,j}\cdot\sin(\vb{k}(\theta_i)\cdot \vb{x} - \omega(\theta_i)\cdot t + \phi_j)
\end{equation}
On sait aussi qu'en moyenne, la phase est nulle, de sorte que \(\expval{\phi_j} = 0\), donc on peut de nouveau se débarrasser d'un indice \(j\).
Mentionnons aussi que la constante de phase n'est vraiment pas une quantitée importante dans la représentation mathématique de nos vagues, car les vagues se propagente et on s'intéresse plutôt au spectre, donc
\begin{equation}
   h(\vb{x},t) = \sum_{i} A_{i} \cdot\sin(\vb{k}_i \cdot \vb{x} - \omega_i \cdot t)
\end{equation}
Conceptuellement, dans une modèle à différences finies, la fréquence \(\omega\) n'est qu'une variable comme une autre, de sorte que la hauteur de la surface pourrait aussi être illustrée par
\begin{equation}
\label{eq:org5c83a61}
   \boxed{\quad h(\vb{x},t,k) = A(k) \cdot\sin(\vb{k} \cdot \vb{x} - \sqrt{gk}\cdot t).\quad}
\end{equation}
Ainsi, toutes les vagues se propageant à la surface de l'océan devraient avoir la composante \ref{eq:org5c83a61} précédente.
Pour obtenir les coefficients de notre transformée de Fourier spatiale, on intégrerait justement par rapport aux \emph{vagues possibles mathématiquement} (la forme qu'on a trouvé précédemment), soit
\begin{equation}
   A(k,t) = \iint_0^{x_{max}} \tilde{h}(\vb{x},t,k) \cdot \sin(\vb{k} \cdot \vb{x} - \sqrt{gk}\cdot t) \dd x\dd y.
\end{equation}
où \(\tilde{h}\) fait justement référence au champ de vagues réel. 
Heureusement, grace au théorême de Parseval, on sait qu'il existe une invariant qui nous permet de dire
\begin{equation}
   E(t) \propto \sum_i \qty[A(k_i,t)]^2 = \sum_i \qty[h(\vb{x}_i,t)]^2
\end{equation}
d'oû la possibilité d'évaluer l'énergie pour chaque nombre d'onde \(k_i\) et fréquences \(\omega_i\).
