2024/Fichiers_tex/rapport-2024-07-26.tex
\subsection{Lien avec la documentation de Wavewatch III}
\label{sec:orge687b06}
Selon \Textcite{william2013wave}, dans le cas où le courant est nul, on peut toujours considérer la vitesse associée à l'advection comme la vitesse de groupe \(c_g\).
Pour s'en convaincre, reprenons la documentation de Wavewatch III \autocite[p.11 et 13]{wwiii2016user}.
On y retrouve une définition plus concrète du courant d'advection,
\begin{subequations}
\begin{align}
   & \dot{\vb{x}} = \vb{c}_g + \vb{U},\grande\\
   & \omega = \sigma + \vb{k}\cdot \vb{U},
\end{align}
\end{subequations}
où \(\sigma\) est la fréquence relative (\(2\pi f_r\)), \(\omega\) est la fréquence absolue (\(2\pi f_a\)) et \(\vb{U}\) est la vitesse du courant d'advection. 
La relation de dispersion \autocite[voir][p.11]{wwiii2016user} est illustrée par
\begin{subequations}
\label{eq:org282f871}
\begin{align}
   &\sigma = \sqrt{ gk \tanh kd }, \\
   &\lim_{d\rightarrow\infty} \sigma = \sqrt{gk},
\end{align}
\end{subequations}
où la relation de dispersion pour les vagues océanique (\(d\rightarrow\infty\)) est illustrée en bas.
Les auteurs optent aussi pour une représentation de \textbf{la spectre de densité d'action des vagues} (\emph{wave action density spectrum}) bien différente de \ref{eq:orgea0c11e} (que j'ai adapté à 1 dimension), soit
\begin{equation}
   \pdv{N}{t} + \pdv{}{x}\qty(\dot{x} N) + \pdv{}{k} \qty(\dot{k}N)  = 0.
\end{equation}
ça revient absolument au même, voir le développement à l'aide d'une quantité fictive \(\beta\).\bigskip

\exemple Soit une quantité \(\beta(x,\omega,t)\).
Alors la dérivée en chaîne de \(N\) par rapport à cette même quantité peut être exprimée par
\begin{align}
   \pdv{}{\beta}\qty(\dot{\beta} N) &= \pdv{}{\beta} \qty(\pdv{\beta}{t} N),\nonumber\\
   &= N \qty(\pdv{}{\beta} \qty(\pdv{\beta}{t})) + \pdv{\beta}{t}\pdv{N}{\beta},\nonumber\\
   &= N \qty(\pdv{}{t} \qty(\pdv{\beta}{\beta})) + \pdv{\beta}{t}\pdv{N}{\beta},\nonumber\\
   &= N \qty(\pdv{}{t} \qty(1)) + \pdv{\beta}{t}\pdv{N}{\beta},\nonumber\\
   &= \dot{\beta}\pdv{N}{\beta}.
\end{align}
Mentionnons aussi qu'on a plusieurs quantités ayant des noms similaires, soit le spectre d'énergie \(E\) ou de variance (C'est la même chose), mais on utilise plutôt le \textbf{spectre de densité d'action des vagues} (\emph{wave action density spectrum}) \(N\) en raison de la conservation (\(N = F/\sigma\)),
\begin{equation}
  \boxed{\quad \grande\dv{N}{t} = \frac{S}{\sigma}.\quad }
\end{equation}
\subsection{Retour à la maîtrise d'Eliot Bismuth}
\label{sec:orgb921299}

On retrouve donc la formulation utilisée par \Textcite{william2013wave} et dans la maîtrise de Bismuth.
Grossièrement, le modèle de Bismuth fait un pas d'advection à l'aide de la \href{https://en.wikipedia.org/wiki/Lax\%E2\%80\%93Wendroff\_method}{méthode de Lax-Wendroff,} soit une méthode très efficace pour résoudre les équations différentielles hyperboliques de la forme
\begin{equation}
\label{eq:orgfa16c26}
   \pdv{u(x,t)}{t} = \pdv{}{x}\qty(f(u(x,t))).
\end{equation}
Selon l'article de \Textcite{william2013wave} (et comme précédemment), l'advection est définit par l'expression
\begin{equation}
   \dv{S}{t} = \pdv{S}{t} + c_g \pdv{S}{x} = 0,
\end{equation}
où \(S\) est la fonction de densité spectrale, généralement exprimé par \(N\) (comme partout précédemment) (À revérifier).
De toute manière, dans la maîtrise de Bismuth, nous prenons la convention pour \(E(\omega,x,t)\), donc l'advection est exprimée par
\begin{equation}
\label{eq:org4215ad5}
   \dv{E}{t} = \pdv{E}{t} + c_g \pdv{E}{x} = 0,
\end{equation}

\nb Il n'y a pas d'étalement selon les fréquences.
La raison est simple : l'étalement du aux fréquences est vu comme un terme source, car ça peut dépendre de plein de chose, dont principalement le \emph{whitecapping}.
C'est pourquoi on ne tend pas vraiment à l'ajouter directement dans l'advection.\bigskip

Donc, en suivant \ref{eq:orgfa16c26}, ont voit que le terme
\begin{equation}
   c_g \pdv{E}{x} = \pdv{}{x} \qty(c_g E) = \pdv{}{x} \qty(f(E(x,t))) \quad\quad \mathrm{où} \quad\quad f\qty(E(x,t)) = c_g E.
\end{equation}
C'est \textbf{un cas linéaire} où \(f(u) = A\cdot u\), soit
\begin{equation}
   u_i^{n+1} = u_i^n - \qty(\frac{\Delta t}{2\Delta x}) A \qty[u^n_{i+1} - u^n_{i-1}] + \qty(\frac{\Delta t^2}{2 \Delta x^2})A^2 \qty[u^n_{i+1} -2u^n_{i} + u^n_{i-1}],
\end{equation}
Avec nos quantités, nous aurions plutôt le schéma de Lax-Wendroff suivant : 
\begin{equation}
   \boxed{\quad E_i^{n+1} = E_i^n - \qty(\frac{\Delta t}{2\Delta x}) c_g \qty[E^n_{i+1} - E^n_{i-1}] + \qty(\frac{\Delta t^2}{2 \Delta x^2})c_g^2 \qty[E^n_{i+1} -2E^n_{i} + E^n_{i-1}].\quad}
\end{equation}
\subsection{Termes sources}
\label{sec:orgab02a21}

\subsubsection{Génération par le vent}
\label{sec:orga975db3}

Dans la maîtrise de Bismuth (2014), on assume une croissance linéaire, soit
\begin{equation}
   S = a + bE,
\end{equation}
où \(a\) est la croissance initiale des vagues
Un peu comme dans le célèbre article de Phillips, on pourrait dire que c'est du bruit ou de la perturbation au niveau statistique.
La partie \(bE\) est tirée d'un autre célèbre article, celui de Komen et al (1984), de sorte que
\begin{equation}
   b = 0.25\qty(\frac{\rho_A}{\rho_W})\omega\qty(28\frac{u_*}{c_p} - 1).
\end{equation}
Rapidement, \(\omega\) est définit comme la fréquence radiale (\(\omega \equiv 2\pi f\quad\qty[\rad\cdot\mathrm{s}^{-1}]\)); \(c_p\) est la vitesse de phase et \(u_*\) est la \emph{friction velocity} (Vitesse de frottement).\bigskip

Bismuth (2014) utilise schéma suivant pour la vitesse de friction
\begin{equation}
   u_* = \left\lbrace \begin{matrix}
     &U_{10}\sqrt{1.2875\times10^{-3}} & \text{pour}\quad U_{10} < 7.5\ \mathrm{ms}^{-1}\\
     &U_{10}\sqrt{\qty(0.8+0.065U_{10})\times10^{-3}} & \text{pour}\quad U_{10}\geq 7.5\ \mathrm{ms}^{-1}\\
   \end{matrix}\right.
\end{equation}




Par contre, je suggère qu'on utilise plutôt le schéma dépendant du profil inverse logarithmique, comme exprimé dans ma maîtrise.
En premier lieu, on retrouve \(u_*\) à l'aide de sa définition
\begin{equation}
   u_* = \sqrt{c_D} u_{10}.
\end{equation}


Pour trouver la valeur de \(c_D\), on travaille avec la relation de Charnok \autocite{charnock1955wind} aussi tirée de \Textcite[p.30]{gill-atmosphere-ocean}, de sorte que 
\begin{align}
\label{eq:orge7515bd}
   &&c_D = \qty[\frac{\kappa}{\ln(z/z_{\pt0})}]_{\ z=10\pt m}^2
   && \text{où} &&
   z_0 = \frac{\alpha_{Ch}\tau_a}{\rho_a g} = \frac{\alpha_{Ch} c_D |u_{10}|^2}{g}. &&
\end{align}

\begin{center}
\begin{tabular}{clll}
Variable & Valeur & Unités & Description\\
\hline
c\textsubscript{D} & À déterminer & -- & Coefficient de traînée\\
\(\kappa\) & 0.41 & -- & Constante de Von Karman\\
z & 10 & m & Hauteur de la mesure du vent (Typiquement 10m)\\
z\textsubscript{0} & À déterminer & m & Rugosité de l'interface (\emph{roughness lenght})\\
\(\alpha\)\textsubscript{Ch} & 0.0185 & -- & Valeur minimale du \href{https://codes.ecmwf.int/grib/param-db/148}{paramètre de Charnock} (Voir ECWAM)\\
\(\tau\)\textsubscript{a} & À déterminer & N m\textsuperscript{-2} & Stress atmosphérique\\
g & 9.81 & m s\textsuperscript{-2} & Accélération gravitationnelle\\
\(\rho\)\textsubscript{a} & 1.225 & Kg m\textsuperscript{-3} & Densité atmosphérique\\
\end{tabular}
\end{center}
