2024/rapport-2024-07-26.org
*** /White-capping/ et étalement dans les fréquences

Le terme de /white-capping/ est exprimé [cite:@hasselmann1974spectral] comme
\begin{equation}
   S_{wc} = -\mu kE,
\end{equation}
où $\mu$ est un coefficient du rapport entre notre spectre et celui de Pierson-Moscowitz.
Ce dernier est exprimé par
\begin{equation}
   \mu - 2.36\times 10^{-5} \qty(\frac{\tilde{s}}{s_{PS}})^4 \frac{\tilde{\omega}}{\tilde{k}}.
\end{equation}
On utilise la lettre $s$ pour représenter la /steepness/ (ou la pente de nos vagues), de sorte que
+ $\tilde{s}$ est la pente moyenne définit par $\tilde{s} = \tilde{k} \sqrt{m_0}$ où $m_0$ est le $0^\text{ième}$ moment de notre spectre d'énergie -- autrement dit c'est l'énergie totale.
+ $s_{PM}$ est la même quantité mais pour le spectre de Pierson-Moscowitz ($\sim \sqrt{3.02\times10^{-3}}$).
On calcule $\tilde{\omega}$ et $\tilde{k}$ à l'aide des expressions
\begin{subequations}
\begin{align}
   \tilde{\omega} =& \qty[m_0^{-1} \int_0^\infty \omega^{-1} E(\omega)\pt \dd \omega\ \ ]^{-1} \\
   \tilde{k} =& \qty[m_0^{-1} \int_0^\infty k^{-1/2} E(\omega)\pt \dd \omega]^{-2}
\end{align}
\end{subequations}
Bismuth résoud les intrégrales précédentes à l'aide de la méthode des trapèzes (audacieux).

|       <c>        | <l>                      | <l>                         | <l>                                      |
|     Variable     | Valeur                   | Unités                      | Description                              |
|------------------+--------------------------+-----------------------------+------------------------------------------|
|       \mu        | À déterminer             | --                          | Rapport d'échelle avec Pierson-Moskowitz |
|   $\tilde{s}$    | À déterminer             | ?                           | Pente ou /steepness/                       |
|     $s_{PM}$     | $\sqrt{3.02\times10^-3}$ | ?                           | Pente pour Pierson-Moskowitz             |
| $\tilde{\omega}$ | À déterminer             | $\rad\cdot \mathrm{s}^{-1}$ | Fréquence moyenne                        |
|   $\tilde{k}$    | À déterminer             | $\rad\cdot \mathrm{m}^{-1}$ | Nombre d'onde moyen                      |
|      $m_0$       | À déterminer             | J                           | Énergie totale (premier moment)          |

*** Atténuation par la glace

L'atténuation par la glace prend une forme très simple, soit
\begin{equation}
   S_{ice} = -\alpha E
\end{equation}
où $\alpha$ est définit comme
\begin{equation}
   \alpha = \frac{\bar{\alpha}}{\expval{D}}.
\end{equation}
Officiellement les quantités précédentes sont
+ $\bar{\alpha}$, soit un coefficient d'atténuation empirique,
+ $\expval{D}$, la taille moyenne des floes.
Il faut résoudre un polynôme pour obtenir la quantité $\bar{\alpha}$, malheureusement.

|      <c>       | <l>          | <l>               | <l>                                   |
|    Variable    | Valeur       | Unités            | Description                           |
|----------------+--------------+-------------------+---------------------------------------|
|     \alpha     | À déterminer | $\mathrm{m}^{-1}$ | Coefficient d'atténuation             |
| $\bar{\alpha}$ | À déterminer | ?                 | Autre coefficient qui dépend de tout. |
|  $\expval{D}$  | À déterminer | m                 | Taille moyenne des floes              |



*** Limitation du changement de densité d'action

\begin{equation}
   \Delta S_{max} = \frac{8.1\times10^{-4}}{2\omega k^3 c_g}
\end{equation}


* Installation LaTeX avec Archlinux

Comme à l'habitude, une installation complète de [[https://wiki.archlinux.org/title/TeX_Live][TexLive]] est toujours nécessaire lors d'un changement de distribution.
À l'instar d'Ubuntu, l'action /sudo apt-get install texlive-full/ n'est pas disponible, car le concept de Archlinux est de tout compartimenter dans le but de minimiser les /packages/ actifs. 
Grossièrement, voici comment installer tous les compartiments nécessaire au fonctionnement de mon préambule LaTeX Org-Mode (en une seule commande) : 
#+begin_src bash
 >>> sudo pacman -S texlive-basic texlive-latex texlive-latexrecommended
                           texlive-fontsrecommended texlive-fontsextra texlive-bibtexextra
                           texlive-mathscience texlive-binextra texlive-latexextra
			   biber
#+end_src
+ Le /package/ « biblatex » est installée à l'aide de la *texlive-bibtexextra*. 
+ La commande /latexmk/ est installée à l'aide de [[https://bbs.archlinux.org/viewtopic.php?id=286621][texlive-binextra]].
+ Le /package/ « csquote » est installé à l'aide de [[https://bbs.archlinux.org/viewtopic.php?id=63529][texlive-latexextra]].
+ Pour faire marche LaTeX en Français, il faut installer [[https://archlinux.org/packages/extra/any/texlive-langfrench/][texlive-langfrench]].
+ Besoin de Biber pour gérer le lien entre les citations et la bibliographie (voir [[https://wiki.archlinux.org/title/TeX_Live][la page de Texlive]]). 


#+print_bibliography:
