2024/Fichiers_tex/rapport-2024-07-26.tex
\subsubsection{\emph{White-capping} et étalement dans les fréquences}
\label{sec:orgaece676}

Le terme de \emph{white-capping} est exprimé \autocite{hasselmann1974spectral} comme
\begin{equation}
   S_{wc} = -\mu kE,
\end{equation}
où \(\mu\) est un coefficient du rapport entre notre spectre et celui de Pierson-Moscowitz.
Ce dernier est exprimé par
\begin{equation}
   \mu - 2.36\times 10^{-5} \qty(\frac{\tilde{s}}{s_{PS}})^4 \frac{\tilde{\omega}}{\tilde{k}}.
\end{equation}
On utilise la lettre \(s\) pour représenter la \emph{steepness} (ou la pente de nos vagues), de sorte que
\begin{itemize}
\item \(\tilde{s}\) est la pente moyenne définit par \(\tilde{s} = \tilde{k} \sqrt{m_0}\) où \(m_0\) est le \(0^\text{ième}\) moment de notre spectre d'énergie -- autrement dit c'est l'énergie totale.
\item \(s_{PM}\) est la même quantité mais pour le spectre de Pierson-Moscowitz (\(\sim \sqrt{3.02\times10^{-3}}\)).
\end{itemize}
On calcule \(\tilde{\omega}\) et \(\tilde{k}\) à l'aide des expressions
\begin{subequations}
\begin{align}
   \tilde{\omega} =& \qty[m_0^{-1} \int_0^\infty \omega^{-1} E(\omega)\pt \dd \omega\ \ ]^{-1} \\
   \tilde{k} =& \qty[m_0^{-1} \int_0^\infty k^{-1/2} E(\omega)\pt \dd \omega]^{-2}
\end{align}
\end{subequations}
Bismuth résoud les intrégrales précédentes à l'aide de la méthode des trapèzes (audacieux).

\begin{center}
\begin{tabular}{clll}
Variable & Valeur & Unités & Description\\
\hline
\(\mu\) & À déterminer & -- & Rapport d'échelle avec Pierson-Moskowitz\\
\(\tilde{s}\) & À déterminer & ? & Pente ou \emph{steepness}\\
s\textsubscript{PM} & \sqrt{3.02\times10^°-3} & ? & Pente pour Pierson-Moskowitz\\
\(\tilde{\omega}\) & À déterminer & \rad\(\cdot\) s\textsuperscript{-1} & Fréquence moyenne\\
\(\tilde{k}\) & À déterminer & \rad\(\cdot\) m\textsuperscript{-1} & Nombre d'onde moyen\\
m\textsubscript{0} & À déterminer & J & Énergie totale (premier moment)\\
\end{tabular}
\end{center}
\subsubsection{Atténuation par la glace}
\label{sec:org3a57f89}

L'atténuation par la glace prend une forme très simple, soit
\begin{equation}
   S_{ice} = -\alpha E
\end{equation}
où \(\alpha\) est définit comme
\begin{equation}
   \alpha = \frac{\bar{\alpha}}{\expval{D}}.
\end{equation}
Officiellement les quantités précédentes sont
\begin{itemize}
\item \(\bar{\alpha}\), soit un coefficient d'atténuation empirique,
\item \(\expval{D}\), la taille moyenne des floes.
\end{itemize}
Il faut résoudre un polynôme pour obtenir la quantité \(\bar{\alpha}\), malheureusement.

\begin{center}
\begin{tabular}{clll}
Variable & Valeur & Unités & Description\\
\hline
\(\alpha\) & À déterminer & m\textsuperscript{-1} & Coefficient d'atténuation\\
\(\bar{\alpha}\) & À déterminer & ? & Autre coefficient qui dépend de tout.\\
\(\expval{D}\) & À déterminer & m & Taille moyenne des floes\\
\end{tabular}
\end{center}
\subsubsection{Limitation du changement de densité d'action}
\label{sec:org5731ecf}

\begin{equation}
   \Delta S_{max} = \frac{8.1\times10^{-4}}{2\omega k^3 c_g}
\end{equation}
\section{Installation \LaTeX{} avec Archlinux}
\label{sec:orgdd18d34}

Comme à l'habitude, une installation complète de \href{https://wiki.archlinux.org/title/TeX\_Live}{TexLive} est toujours nécessaire lors d'un changement de distribution.
À l'instar d'Ubuntu, l'action \emph{sudo apt-get install texlive-full} n'est pas disponible, car le concept de Archlinux est de tout compartimenter dans le but de minimiser les \emph{packages} actifs. 
Grossièrement, voici comment installer tous les compartiments nécessaire au fonctionnement de mon préambule \LaTeX{} Org-Mode (en une seule commande) : 
\begin{verbatim}
 >>> sudo pacman -S texlive-basic texlive-latex texlive-latexrecommended
                           texlive-fontsrecommended texlive-fontsextra texlive-bibtexextra
                           texlive-mathscience texlive-binextra texlive-latexextra
			   biber
\end{verbatim}
\begin{itemize}
\item Le \emph{package} « biblatex » est installée à l'aide de la \textbf{texlive-bibtexextra}.
\item La commande \emph{latexmk} est installée à l'aide de \href{https://bbs.archlinux.org/viewtopic.php?id=286621}{texlive-binextra}.
\item Le \emph{package} « csquote » est installé à l'aide de \href{https://bbs.archlinux.org/viewtopic.php?id=63529}{texlive-latexextra}.
\item Pour faire marche \LaTeX{} en Français, il faut installer \href{https://archlinux.org/packages/extra/any/texlive-langfrench/}{texlive-langfrench}.
\item Besoin de Biber pour gérer le lien entre les citations et la bibliographie (voir \href{https://wiki.archlinux.org/title/TeX\_Live}{la page de Texlive}).
\end{itemize}


\printbibliography
\end{document}
